## Create op

```
Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_s3_bucket.example will be created
  + resource "awscc_s3_bucket" "example" {
      + analytics_configurations           = (known after apply)
      + arn                                = (known after apply)
      ....
      + replication_configuration          = (known after apply)
      + tags                               = [
          + {
              + key   = "key1"
              + value = "value1"
            },
          + {
              + key   = "key2"
              + value = "value2"
            },
          + {
              + key   = "key4"
              + value = "value4"
            },
          + {
              + key   = "key3"
              + value = "value3"
            },
          + {
              + key   = "key5"
              + value = "value5"
            },
          + {
              + key   = "key6"
              + value = "value6"
            },
        ]
      + versioning_configuration           = (known after apply)
      + website_configuration              = (known after apply)
      + website_url                        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_s3_bucket.example: Creating...
awscc_s3_bucket.example: Still creating... [10s elapsed]
awscc_s3_bucket.example: Creation complete after 15s [id=manu-test-12342025]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

****************

## Removed tags

```
  tags = [
    # {
    #   key   = "key1"
    #   value = "value1"
    # },
    {
      key   = "key2"
      value = "value2"
    },

    {
      key   = "key4"
      value = "value4"
    },
    # {
    #   key   = "key3"
    #   value = "value3"
    # },
    # {
    #   key   = "key5"
    #   value = "value5"
    # },
    # {
    #   key   = "key6"
    #   value = "value6"
    # }
  ]
}
```

```
   ~ tags                               = [
            {
                key   = "key2"
                value = "value2"
            },
          ~ {
              ~ key   = "key5" -> "key4"
              ~ value = "value5" -> "value4"
            },
          - {
              - key   = "key6" -> null
              - value = "value6" -> null
            },
          - {
              - key   = "key3" -> null
              - value = "value3" -> null
            },
          - {
              - key   = "key4" -> null
              - value = "value4" -> null
            },
        ]
      + versioning_configuration           = (known after apply)
      + website_configuration              = (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
awscc_s3_bucket.example: Modifying... [id=manu-test-12342025]
awscc_s3_bucket.example: Still modifying... [id=manu-test-12342025, 10s elapsed]
awscc_s3_bucket.example: Still modifying... [id=manu-test-12342025, 20s elapsed]
awscc_s3_bucket.example: Still modifying... [id=manu-test-12342025, 30s elapsed]
awscc_s3_bucket.example: Still modifying... [id=manu-test-12342025, 40s elapsed]
awscc_s3_bucket.example: Still modifying... [id=manu-test-12342025, 50s elapsed]
awscc_s3_bucket.example: Modifications complete after 59s [id=manu-test-12342025]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

```
************************

## uncommented tag 1

```
  tags = [
    {
      key   = "key1"
      value = "value1"
    },
    {
      key   = "key2"
      value = "value2"
    },

    {
      key   = "key4"
      value = "value4"
    },
    # {
    #   key   = "key3"
    #   value = "value3"
    # },
    # {
    #   key   = "key5"
    #   value = "value5"
    # },
    # {
    #   key   = "key6"
    #   value = "value6"
    # }
  ]
```

```
      + replication_configuration          = (known after apply)
      ~ tags                               = [
          ~ {
              ~ key   = "key2" -> "key1"
              ~ value = "value2" -> "value1"
            },
          ~ {
              ~ key   = "key4" -> "key2"
              ~ value = "value4" -> "value2"
            },
          + {
              + key   = "key4"
              + value = "value4"
            },
        ]
      + versioning_configuration           = (known after apply)
      + website_configuration              = (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
awscc_s3_bucket.example: Modifying... [id=manu-test-12342025]
awscc_s3_bucket.example: Still modifying... [id=manu-test-12342025, 10s elapsed]
awscc_s3_bucket.example: Still modifying... [id=manu-test-12342025, 20s elapsed]
awscc_s3_bucket.example: Still modifying... [id=manu-test-12342025, 30s elapsed]
awscc_s3_bucket.example: Modifications complete after 31s [id=manu-test-12342025]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

```

************************

## Destroy operation

```
awscc_s3_bucket.example: Refreshing state... [id=manu-test-12342025]

Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # awscc_s3_bucket.example will be destroyed
  # (because awscc_s3_bucket.example is not in configuration)
  - resource "awscc_s3_bucket" "example" {
      - arn                               = "arn:aws:s3:::manu-test-12342025" -> null
      - bucket_encryption                 = {
          - server_side_encryption_configuration = [
              - {
                  - bucket_key_enabled                = false -> null
                  - server_side_encryption_by_default = {
                      - sse_algorithm = "AES256" -> null
                    } -> null
                },
            ] -> null
        } -> null
      - bucket_name                       = "manu-test-12342025" -> null
      - domain_name                       = "manu-test-12342025.s3.amazonaws.com" -> null
      - dual_stack_domain_name            = "manu-test-12342025.s3.dualstack.us-east-1.amazonaws.com" -> null
      - id                                = "manu-test-12342025" -> null
      - ownership_controls                = {
          - rules = [
              - {
                  - object_ownership = "BucketOwnerEnforced" -> null
                },
            ] -> null
        } -> null
      - public_access_block_configuration = {
          - block_public_acls       = true -> null
          - block_public_policy     = true -> null
          - ignore_public_acls      = true -> null
          - restrict_public_buckets = true -> null
        } -> null
      - regional_domain_name              = "manu-test-12342025.s3.us-east-1.amazonaws.com" -> null
      - tags                              = [
          - {
              - key   = "key1" -> null
              - value = "value1" -> null
            },
          - {
              - key   = "key2" -> null
              - value = "value2" -> null
            },
          - {
              - key   = "key4" -> null
              - value = "value4" -> null
            },
          - {
              - key   = "key3" -> null
              - value = "value3" -> null
            },
          - {
              - key   = "key5" -> null
              - value = "value5" -> null
            },
          - {
              - key   = "key6" -> null
              - value = "value6" -> null
            },
        ] -> null
      - website_url                       = "http://manu-test-12342025.s3-website-us-east-1.amazonaws.com" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
awscc_s3_bucket.example: Destroying... [id=manu-test-12342025]
awscc_s3_bucket.example: Destruction complete after 5s

Apply complete! Resources: 0 added, 0 changed, 1 destroyed.


```